src/cf/Catalogs/КалендарьПодготовкиОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КалендарьПодготовкиОтчетности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиКалендаряПодготовкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИнформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОбработкиСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВКалендаре</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяДляИП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяДляООО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеренесенногоОкончанияСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСобытияДляПострадавших</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпрощенныйЗачетФиксированныхВзносов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОтчетыУНФВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ОтчетыУНФ.ДобавитьОтчетВИсторию
Процедура ДобавитьОтчетВИсторию(Вариант) Экспорт
	
	ОтчетыУНФ.ДобавитьОтчетВИсторию(Вариант);
	
КонецПроцедуры

// См. ОтчетыУНФ.ПолучитьПереопределенныйКомпоновщикНастроек
Функция ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы) Экспорт
	
	Возврат ОтчетыУНФ.ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы);
	
КонецФункции

// См. ОтчетыУНФ.СформироватьКонтактыДляЭкспорта
Процедура СформироватьКонтактыДляЭкспорта(ОтчетДанныеРасшифровки, КонтактыОтчета) Экспорт
	ОтчетыУНФ.СформироватьКонтактыДляЭкспорта(ОтчетДанныеРасшифровки, КонтактыОтчета)
КонецПроцедуры

// См. ОтчетыУНФ.СформироватьНоменклатуруДляЭкспорта
Процедура СформироватьНоменклатуруДляЭкспорта(ОтчетДанныеРасшифровки, НоменклатураОтчета) Экспорт
	ОтчетыУНФ.СформироватьНоменклатуруДляЭкспорта(ОтчетДанныеРасшифровки, НоменклатураОтчета)
КонецПроцедуры

Функция ПолучитьКомпоновщикОтчетаПоИмени(ИмяОтчета) Экспорт
	Возврат Отчеты[ИмяОтчета].Создать().КомпоновщикНастроек;
КонецФункции

Функция СписокВидовНалоговПоЗадачамКалендаря(ЗадачиКалендаря, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаВидовНалоговЗадачКалендаря.ВидНалога КАК Справочник.ВидыНалогов) КАК ВидНалога,
		|	ВЫРАЗИТЬ(ТаблицаВидовНалоговЗадачКалендаря.ЗадачаКалендаряПодготовкиОтчетности КАК Справочник.ЗадачиКалендаряПодготовкиОтчетности) КАК ЗадачаКалендаряПодготовкиОтчетности
		|ПОМЕСТИТЬ втВходящаяТЗ
		|ИЗ
		|	&ТаблицаВидовНалоговЗадачКалендаря КАК ТаблицаВидовНалоговЗадачКалендаря
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидНалога,
		|	ЗадачаКалендаряПодготовкиОтчетности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втВходящаяТЗ.ВидНалога КАК ВидНалога
		|ИЗ
		|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВходящаяТЗ КАК втВходящаяТЗ
		|		ПО КалендарьПодготовкиОтчетности.Задача = втВходящаяТЗ.ЗадачаКалендаряПодготовкиОтчетности
		|ГДЕ
		|	КалендарьПодготовкиОтчетности.Задача В ИЕРАРХИИ (&ЗадачиКалендаря)
		|	И КалендарьПодготовкиОтчетности.ДатаНачалаДокументов >= &ПериодН";
		
	Запрос.УстановитьПараметр("ЗадачиКалендаря", 					ЗадачиКалендаря.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ПериодН", 							Период);	
	Запрос.УстановитьПараметр("ТаблицаВидовНалоговЗадачКалендаря", 	УчетУСНПовтИсп.ВидНалогаЗадачиКалендаряПодготовкиОтчетности());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивВидовНалогов = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		МассивВидовНалогов.Добавить(Выборка.ВидНалога);	

	КонецЦикла;

	Возврат МассивВидовНалогов;

КонецФункции	
#КонецОбласти
